Revit 2027 API
BuiltInFailures.SketchFailures.CannotComputeRailingsElevation Property
 Can't compute Railings Elevation Profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotComputeRailingsElevation { get; }
Public Shared ReadOnly Property CannotComputeRailingsElevation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotComputeRailingsElevation {
	FailureDefinitionId^ get ();
}
static member CannotComputeRailingsElevation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace